benchmarks/runpod_b200/benchmark_results_qwen3_32b_b200/run_1_TP8_DP1_CTX15000_C100_P100_O128.txt
BENCHMARK: run_1_TP8_DP1_CTX15000_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7464b20c11c0>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15000, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/qwen3-32b', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_qwen3_32b_b200', result_filename='run_1_TP8_DP1_CTX15000_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-3ea236ec-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-29 00:25:43 [datasets.py:612] Sampling input_len from [15000, 15000] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:11<18:12, 11.04s/it]
  8%|▊         | 8/100 [00:11<01:33,  1.02s/it]
 18%|█▊        | 18/100 [00:11<00:29,  2.75it/s]
 28%|██▊       | 28/100 [00:11<00:13,  5.16it/s]
 38%|███▊      | 38/100 [00:11<00:07,  8.37it/s]
 49%|████▉     | 49/100 [00:11<00:03, 13.07it/s]
 61%|██████    | 61/100 [00:11<00:01, 19.63it/s]
 74%|███████▍  | 74/100 [00:11<00:00, 28.40it/s]
 92%|█████████▏| 92/100 [00:11<00:00, 43.83it/s]
100%|██████████| 100/100 [00:11<00:00,  8.37it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  11.95     
Total input tokens:                      1500000   
Total generated tokens:                  12800     
Request throughput (req/s):              8.37      
Output token throughput (tok/s):         1071.49   
Peak output token throughput (tok/s):    4612.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          126636.37 
---------------Time to First Token----------------
Mean TTFT (ms):                          5341.59   
Median TTFT (ms):                        5373.39   
P99 TTFT (ms):                           10359.87  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          48.84     
Median TPOT (ms):                        48.96     
P99 TPOT (ms):                           83.66     
---------------Inter-token Latency----------------
Mean ITL (ms):                           48.84     
Median ITL (ms):                         13.91     
P99 ITL (ms):                            127.28    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11543.69  
Median E2EL (ms):                        11587.38  
P99 E2EL (ms):                           11899.67  
==================================================